01Hub/fbedit/STM32F4Discovery/STN32F4_GTVTerminal/video.c

/*******************************************************************************
* PAL timing Horizontal
* H-sync         4,70uS
* Back porch     5,70uS
* Active video  51,95uS
* Front porch    1,65uS
* Line total     64,0uS
*
* |                 64.00uS                      |
* |4,70|  5,70  |          51,95uS          |1,65|
*
*                ---------------------------
*               |                           |
*               |                           |
*               |                           |
*       --------                             ----
* |    |                                         |
* -----                                          ----
*
* PAL timing Vertical
* V-sync        0,576mS (9 lines)
* Frame         20mS (312,5 lines)
* Video signal  288 lines
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"
#include "video.h"
#include "Font8x10.h"

/* Private variables ---------------------------------------------------------*/
uint8_t BackBuff[SCREEN_BUFFHEIGHT][SCREEN_BUFFWIDTH];
uint8_t FrameBuff[SCREEN_BUFFHEIGHT][SCREEN_BUFFWIDTH];
volatile int16_t LineCount;
volatile uint16_t FrameCount;
volatile int8_t BackPochFlag;
SPRITE Cursor;
SPRITE* Sprites[MAX_SPRITES];
WINDOW* Windows[MAX_WINDOWS];
WINDOW* Focus;
volatile uint8_t FrameDraw;

volatile uint32_t LcMin;
volatile uint32_t LcMax;


/* Private function prototypes -----------------------------------------------*/
void SetCursor(uint8_t cur);
void MoveCursor(uint16_t x,uint16_t y);
void ShowCursor(uint8_t z);
void Cls(void);
void SetPixel(uint16_t x,uint16_t y,uint8_t c);
uint8_t GetPixel(uint16_t x,uint16_t y);
void DrawChar(uint16_t x, uint16_t y, char chr, uint8_t c);
void DrawLargeChar(uint16_t x, uint16_t y, char chr, uint8_t c);
void DrawString(uint16_t x, uint16_t y, char *str, uint8_t c);
void DrawLargeString(uint16_t x, uint16_t y, char *str, uint8_t c);
void DrawDec(uint16_t x, uint16_t y, uint16_t n, uint8_t c);
void DrawLargeDec(uint16_t x, uint16_t y, uint16_t n, uint8_t c);
void DrawHex(uint16_t x, uint16_t y, uint16_t n, uint8_t c);
void DrawBin(uint16_t x, uint16_t y, uint16_t n, uint8_t c);
void Rectangle(uint16_t x, uint16_t y, uint16_t b, uint16_t a, uint8_t c);
void Circle(uint16_t cx, uint16_t cy, uint16_t radius, uint8_t c);
void Line(uint16_t X1,uint16_t Y1,uint16_t X2,uint16_t Y2, uint8_t c);
void DrawIcon(uint16_t x,uint16_t y,ICON* icon,uint8_t c);
void ScrollUp(void);
void ScrollDown(void);
uint32_t DrawSprite(const SPRITE* ps);

void * memmove(void *dest, void *source, uint32_t count);
void * memset(void *dest, uint32_t c, uint32_t count); 

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  This function sets the cursor (mouse icon) type.
  * @param  cur
  * @retval None
  */
void SetCursor(uint8_t cur)
{
  switch (cur)
  {
    case 0:
      Cursor.icon.wt=8;
      Cursor.icon.ht=10;
      Cursor.icon.icondata=*SelectCur;
      break;
  }
}

/**
  * @brief  This function sets the cursor (mouse icon) position.
  * @param  x, y
  * @retval None
  */
void MoveCursor(uint16_t x,uint16_t y)
{
  Cursor.x=x;
  Cursor.y=y;
}

/**
  * @brief  This function show / hide the cursor (mouse icon).
  * @param  x, y
  * @retval None
  */
void ShowCursor(uint8_t z)
{
  if (z)
  {
    Cursor.visible=1;     // Show
  }
  else
  {
    Cursor.visible=0;     // Hide
  }
}

/**
  * @brief  This function clears the screen.
  * @param  None
  * @retval None
  */
void Cls(void)
{
  memset(&BackBuff, 0, SCREEN_BUFFHEIGHT*SCREEN_BUFFWIDTH);
}

/**
  * @brief  This function sets / clears a pixel at x, y.
  * @param  x, y, c
  * @retval None
  */
void SetPixel(uint16_t x,uint16_t y,uint8_t c)
{
  uint8_t bit;
  if (x < SCREEN_WIDTH && y < SCREEN_HEIGHT)
  {
    bit = 1 << (x & 0x7);
    if (c)
    {
      BackBuff[y][x >> 3] |= bit;
    }
    else
    {
      BackBuff[y][x >> 3] &= ~bit;
    }
  }
}

/**
  * @brief  This function gets a pixel at x, y.
  * @param  x, y
  * @retval 1 if set
  */
uint8_t GetPixel(uint16_t x,uint16_t y)
{
  uint8_t bit;
  if (x < SCREEN_WIDTH && y < SCREEN_HEIGHT)
  {
    bit = 1 << (x & 0x7);
    return ((BackBuff[y][x >> 3]) & bit) > 0;
  }
  return 0;
}

/**
  * @brief  This function draws a character at x, y.
  * @param  x, y, chr, c
  * @retval None
  */
void DrawChar(uint16_t x, uint16_t y, char chr, uint8_t c)
{
  uint8_t cl;
  uint16_t cx, cy;

  cy=0;
  switch (c)
  {
    case 0:
    case 2:
      /* Clear opaque and inverted opaque */
      while (cy<TILE_HEIGHT)
      {
        cx=0;
        while (cx<TILE_WIDTH)
        {
          SetPixel(x+cx,y+cy,0);
          cx++;
        }
        cy++;
      }
      break;
    case 3:
      chr ^= 0x80;
    case 1:
      /* Draw opaque and inverted opaque */
      while (cy<TILE_HEIGHT)
      {
        cl=Font8x10[chr][cy];
        cx=0;
        while (cx<TILE_WIDTH)
        {
          SetPixel(x+cx,y+cy,(cl & 0x80));
          cl=cl<<1;
          cx++;
        }
        cy++;
      }
      break;
    case 6:
      chr ^= 0x80;
    case 4:
      /* Clear transparent and inverted transparent */
      while (cy<TILE_HEIGHT)
      {
        cl=Font8x10[chr][cy];
        cx=0;
        while (cx<TILE_WIDTH)
        {
          if (cl & 0x80)
          {
            SetPixel(x+cx,y+cy,0);
          }
          cl=cl<<1;
          cx++;
        }
        cy++;
      }
      break;
    case 7:
      chr ^= 0x80;
    case 5:
      /* Draw transparent and inverted transparent */
      while (cy<TILE_HEIGHT)
      {
        cl=Font8x10[chr][cy];
        cx=0;
        while (cx<TILE_WIDTH)
        {
          if (cl & 0x80)
          {
            SetPixel(x+cx,y+cy,1);
          }
          cl=cl<<1;
          cx++;
        }
        cy++;
      }
      break;
  }
}

/**
  * @brief  This function draws a character using large font at x, y.
  * @param  x, y, chr, c
  * @retval None
  */
void DrawLargeChar(uint16_t x, uint16_t y, char chr, uint8_t c)
{
  uint8_t cl;
  uint16_t cx, cy;

  cy=0;
  switch (c)
  {
    case 0:
    case 2:
      /* Clear opaque and inverted opaque */
      while (cy<TILE_HEIGHT*2)
      {
        cx=0;
        while (cx<TILE_WIDTH*2)
        {
          SetPixel(x+cx,y+cy,0);
          SetPixel(x+cx+1,y+cy,0);
          SetPixel(x+cx,y+cy+1,0);
          SetPixel(x+cx+1,y+cy+1,0);
          cx+=2;
        }
        cy+=2;
      }
      break;
    case 3:
      chr ^= 0x80;
    case 1:
      /* Draw opaque and inverted opaque */
      while (cy<TILE_HEIGHT*2)
      {
        cl=Font8x10[chr][cy/2];
        cx=0;
        while (cx<TILE_WIDTH*2)
        {
          SetPixel(x+cx,y+cy,(cl & 0x80));
          SetPixel(x+cx+1,y+cy,(cl & 0x80));
          SetPixel(x+cx,y+cy+1,(cl & 0x80));
          SetPixel(x+cx+1,y+cy+1,(cl & 0x80));
          cl=cl<<1;
          cx+=2;
        }
        cy+=2;
      }
      break;
    case 6:
      chr ^= 0x80;
    case 4:
      /* Clear transparent and inverted transparent */
      while (cy<TILE_HEIGHT*2)
      {
        cl=Font8x10[chr][cy];
        cx=0;
        while (cx<TILE_WIDTH*2)
        {
          if (cl & 0x80)
          {
            SetPixel(x+cx,y+cy,0);
            SetPixel(x+cx+1,y+cy,0);
            SetPixel(x+cx,y+cy+1,0);
            SetPixel(x+cx+1,y+cy+1,0);
          }
          cl=cl<<1;
          cx+=2;
        }
        cy+=2;
      }
      break;
    case 7:
      chr ^= 0x80;
    case 5:
      /* Draw transparent and inverted transparent */
      while (cy<TILE_HEIGHT*2)
      {
        cl=Font8x10[chr][cy];
        cx=0;
        while (cx<TILE_WIDTH*2)
        {
          if (cl & 0x80)
          {
            SetPixel(x+cx,y+cy,1);
            SetPixel(x+cx+1,y+cy,1);
            SetPixel(x+cx,y+cy+1,1);
            SetPixel(x+cx+1,y+cy+1,1);
          }
          cl=cl<<1;
          cx+=2;
        }
        cy+=2;
      }
      break;
  }
}

/**
  * @brief  This function draws a zero terminated string at x, y.
  * @param  x, y, *str, c
  * @retval None
  */
void DrawString(uint16_t x, uint16_t y, char *str, uint8_t c)
{
  char chr;
  while ((chr = *str++))
  {
    DrawChar(x, y, chr, c);
    x+=TILE_WIDTH;
  }
}

/**
  * @brief  This function draws a zero terminated string using large font at x, y.
  * @param  x, y, *str, c
  * @retval None
  */
void DrawLargeString(uint16_t x, uint16_t y, char *str, uint8_t c)
{
  char chr;
  while ((chr = *str++))
  {
    DrawLargeChar(x, y, chr, c);
    x+=TILE_WIDTH*2;
  }
}

/**
  * @brief  This function draws a decimal value at x, y.
  * @param  x, y, n, c
  * @retval None
  */
void DrawDec(uint16_t x, uint16_t y, uint16_t n, uint8_t c)
{
	char decstr[6];
  int8_t i,d;

  d=n/10000;
  n-=d*10000;
  decstr[0]=d | 0x30;
  d=n/1000;
  n-=d*1000;
  decstr[1]=d | 0x30;
  d=n/100;
  n-=d*100;
  decstr[2]=d | 0x30;
  d=n/10;
  n-=d*10;
  decstr[3]=d | 0x30;
  decstr[4]=n | 0x30;
  decstr[5]='\0';
  i=0;
  while (i<4 && decstr[i]==0x30)
  {
    decstr[i]=0x20;
    i++;
  }
  DrawString(x,y,decstr,c);
}

/**
  * @brief  This function draws a decimal value using large font at x, y.
  * @param  x, y, n, c
  * @retval None
  */
void DrawLargeDec(uint16_t x, uint16_t y, uint16_t n, uint8_t c)
{
	char decstr[6];
  int8_t i,d;

  d=n/10000;
  n-=d*10000;
  decstr[0]=d | 0x30;
  d=n/1000;
  n-=d*1000;
  decstr[1]=d | 0x30;
  d=n/100;
  n-=d*100;
  decstr[2]=d | 0x30;
  d=n/10;
  n-=d*10;
  decstr[3]=d | 0x30;
  decstr[4]=n | 0x30;
  decstr[5]='\0';
  i=0;
  while (i<4 && decstr[i]==0x30)
  {
    decstr[i]=0x20;
    i++;
  }
  DrawLargeString(x,y,decstr,c);
}

/**
  * @brief  This function draws a 16 bit hex value at x, y.
  * @param  x, y, n, c
  * @retval None
  */
void DrawHex(uint16_t x, uint16_t y, uint16_t n, uint8_t c)
{
	static char hexchars[] = "0123456789ABCDEF";
	char hexstr[5];
	hexstr[0] = hexchars[(n >> 12) & 0xF];
	hexstr[1] = hexchars[(n >> 8) & 0xF];
	hexstr[2] = hexchars[(n >> 4) & 0xF];
	hexstr[3] = hexchars[n & 0xF];
	hexstr[4] = '\0';
  DrawString(x,y,hexstr,c);
}

/**
  * @brief  This function draws a 16 bit binary value at x, y.
  * @param  x, y, n, c
  * @retval None
  */
void DrawBin(uint16_t x, uint16_t y, uint16_t n, uint8_t c)
{
  uint8_t i;
  i=0;
  while (i<16)
  {
    if (n & 0x8000)
    {
      DrawChar(x,y,0x31,1);
    }
    else
    {
      DrawChar(x,y,0x30,1);
    }
    x+=8;
    n<<=1;
    i++;
  }
}

/**
  * @brief  This function draw a rectangle at x, y with color c.
  * @param  x, y, wdt, hgt, c
  * @retval None
  */
void Rectangle(uint16_t x, uint16_t y, uint16_t wdt, uint16_t hgt, uint8_t c)
{
  uint16_t j;
  for (j = 0; j < hgt; j++) {
		SetPixel(x, y + j, c);
		SetPixel(x + wdt - 1, y + j, c);
	}
  for (j = 0; j < wdt; j++)	{
		SetPixel(x + j, y, c);
		SetPixel(x + j, y + hgt - 1, c);
	}
}

/**
  * @brief  This function draw a circle at x0, y0 with color c.
  * @param  x0, y0, radius, c
  * @retval None
  */
void Circle(uint16_t x0, uint16_t y0, uint16_t radius, uint8_t c)
{
  int f = 1 - radius;
  int ddF_x = 1;
  int ddF_y = -2 * radius;
  int x = 0;
  int y = radius;
 
  SetPixel(x0, y0 + radius, c);
  SetPixel(x0, y0 - radius, c);
  SetPixel(x0 + radius, y0, c);
  SetPixel(x0 - radius, y0, c);
 
  while(x < y)
  {
    if(f >= 0) 
    {
      y--;
      ddF_y += 2;
      f += ddF_y;
    }
    x++;
    ddF_x += 2;
    f += ddF_x;    
    SetPixel(x0 + x, y0 + y, c);
    SetPixel(x0 - x, y0 + y, c);
    SetPixel(x0 + x, y0 - y, c);
    SetPixel(x0 - x, y0 - y, c);
    SetPixel(x0 + y, y0 + x, c);
    SetPixel(x0 - y, y0 + x, c);
    SetPixel(x0 + y, y0 - x, c);
    SetPixel(x0 - y, y0 - x, c);
  }
}

/**
  * @brief  This function draw a line from x1, y1 to x2,y2 with color c.
  * @param  x1, y1, x2, y2, c
  * @retval None
  */
void Line(uint16_t X1,uint16_t Y1,uint16_t X2,uint16_t Y2, uint8_t c)
{
  uint16_t CurrentX, CurrentY, Xinc, Yinc, 
           Dx, Dy, TwoDx, TwoDy, 
           TwoDxAccumulatedError, TwoDyAccumulatedError;

