01Hub/fbedit/STM32F4Discovery/STN32F4_GTVTerminal/video.c
  Dx = (X2-X1);
  Dy = (Y2-Y1);

  TwoDx = Dx + Dx;
  TwoDy = Dy + Dy;

  CurrentX = X1;
  CurrentY = Y1;

  Xinc = 1;
  Yinc = 1;

  if(Dx < 0)
  {
    Xinc = -1;
    Dx = -Dx;
    TwoDx = -TwoDx;
  }

  if (Dy < 0)
  {
    Yinc = -1;
    Dy = -Dy;
    TwoDy = -TwoDy;
  }
  SetPixel(X1,Y1, c);

  if ((Dx != 0) || (Dy != 0))
  {
    if (Dy <= Dx)
    { 
      TwoDxAccumulatedError = 0;
      do
      {
        CurrentX += Xinc;
        TwoDxAccumulatedError += TwoDy;
        if(TwoDxAccumulatedError > Dx)
        {
          CurrentY += Yinc;
          TwoDxAccumulatedError -= TwoDx;
        }
        SetPixel(CurrentX,CurrentY, c);
      }while (CurrentX != X2);
    }
    else
    {
      TwoDyAccumulatedError = 0; 
      do 
      {
        CurrentY += Yinc; 
        TwoDyAccumulatedError += TwoDx;
        if(TwoDyAccumulatedError>Dy) 
        {
          CurrentX += Xinc;
          TwoDyAccumulatedError -= TwoDy;
        }
        SetPixel(CurrentX,CurrentY, c);
      }while (CurrentY != Y2);
    }
  }
}

/**
  * @brief  This function draws an icon
  * @param  x, y, icon, c
  * @retval None
  */
void DrawIcon(uint16_t x,uint16_t y,ICON* icon,uint8_t c)
{
  uint32_t xm,ym,i;
  uint8_t cb;
  const uint8_t *picon;

  /* Draw the icon */
  ym=y+icon->ht;
  xm=x+icon->wt;
  picon=icon->icondata;
  while (y<ym)
  {
    i=x;
    while (i<xm)
    {
      cb=picon[0];
      if (cb!=2)
      {
        if (c)
        {
          /* Set / Clear bit */
          if (cb)
          {
            SetPixel(i,y, 1);
          }
          else
          {
            SetPixel(i,y, 0);
          }
        }
        else if (cb)
        {
          SetPixel(i,y, 0);
        }
      }
      i++;
      picon++;
    }
    y++;
  }
}

/**
  * @brief  This function scrolls the screen 1 line up
  * @param  None
  * @retval None
  */
void ScrollUp(void)
{
  memmove(&BackBuff[0], &BackBuff[1], (SCREEN_BUFFHEIGHT-1)*SCREEN_BUFFWIDTH);
  memset(&BackBuff[SCREEN_BUFFHEIGHT-1], 0, SCREEN_BUFFWIDTH);
}

/**
  * @brief  This function scrolls the screen 1 line down
  * @param  None
  * @retval None
  */
void ScrollDown(void)
{
  uint16_t y=SCREEN_BUFFHEIGHT-1;
  while (y)
  {
    memmove(&BackBuff[y], &BackBuff[y-1], SCREEN_BUFFWIDTH);
    y--;
  }
  memset(&BackBuff[0], 0, SCREEN_BUFFWIDTH);
}

/*********** Draw onto WorkBuff ***********/

/**
  * @brief  This function clears a pixel at x, y.
  * @param  x, y
  * @retval None
  */
void ClearWBPixel(uint16_t x,uint16_t y)
{
  uint8_t bit;
  if (x < SCREEN_WIDTH && y < SCREEN_HEIGHT)
  {
    bit = 1 << (x & 0x7);
    FrameBuff[y][x >> 3] &= ~bit;
  }
}

/**
  * @brief  This function draws a sprite
  * @param  None
  * @retval None
  */
uint32_t DrawSprite(const SPRITE* ps)
{
  uint32_t x,y,xm,ym;
  uint8_t bt,coll,cb;
  const uint8_t *picon;

  coll=0;
  /* Draw the sprite */
  ym=ps->y+ps->icon.ht;
  if (ym>SCREEN_HEIGHT)
  {
    ym=SCREEN_HEIGHT;
  }
  xm=ps->x+ps->icon.wt;
  if (xm>SCREEN_WIDTH)
  {
    xm=SCREEN_WIDTH;
  }
  y=ps->y;
  picon=ps->icon.icondata;
  while (y<ym)
  {
    x=ps->x;
    while (x<xm)
    {
      cb=picon[0];
      if (cb!=2)
      {
        bt = 1 << (x & 0x7);
        
        /* Test collision with background */
        if (BackBuff[y][x >> 3] & bt)
        {
          coll |= COLL_BACKGROUND;
        }
        /* Test collision with another sprite */
        else if (FrameBuff[y][x >> 3] & bt)
        {
          coll |= COLL_SPRITE;
        }
        /* Set / Clear bit */
        if (cb)
        {
          FrameBuff[y][x >> 3] |= bt;
        }
        else
        {
          FrameBuff[y][x >> 3] &= ~bt;
        }
      }
      x++;
      picon++;
    }
    y++;
  }
  return coll;
}

/**
  * @brief  This function draws transparent an inverted character at x, y.
  * @param  x, y, chr
  * @retval None
  */
void DrawWBChar(uint16_t x, uint16_t y, char chr)
{
  uint8_t cl,bit;
  uint16_t cx, cy;

  cy=0;
  while (cy<TILE_HEIGHT)
  {
    cl=Font8x10[chr][cy];
    cx=0;
    while (cx<TILE_WIDTH)
    {
      if (cl & 0x80)
      {
        if (cx < SCREEN_WIDTH && cy < SCREEN_HEIGHT)
        {
          bit = 1 << ((x+cx) & 0x7);
          FrameBuff[y+cy][(x+cx >> 3)] &= ~bit;
        }
      }
      cl=cl<<1;
      cx++;
    }
    cy++;
  }
}

/**
  * @brief  This function draws a string with length len at x, y.
  * @param  x, y, len, *str
  * @retval None
  */
void DrawWBString(uint16_t x, uint16_t y,uint8_t len, char *str)
{
  char chr;
  while (len)
  {
    DrawWBChar(x, y, *str);
    x+=TILE_WIDTH;
    str++;
    len--;
  }
}

/**
  * @brief  This function draws a black rectangle.
  * @param  x,y,wdt,hgt)
  * @retval None
  */
void FrameRect(uint16_t x,uint16_t y,uint16_t wdt,uint16_t hgt)
{
 uint16_t j;
  for (j = 0; j < hgt; j++) {
		ClearWBPixel(x, y + j);
		ClearWBPixel(x + wdt - 1, y + j);
	}
  for (j = 0; j < wdt; j++)	{
		ClearWBPixel(x + j, y);
		ClearWBPixel(x + j, y + hgt - 1);
	}
}

/**
  * @brief  This function draws a window.
  * @param  win
  * @retval None
  */
void DrawWindow(WINDOW* hwin)
{
  uint32_t x,y,xm,ym,i,j;
  uint8_t cl,cr;
  WINDOW* hpar;

  x=hwin->x;
  y=hwin->y;
  if (hwin->owner)
  {
    hpar=hwin->owner;
    x+=hpar->x;
    y+=hpar->y;
  }
  xm=x+hwin->wt;
  ym=y+hwin->ht;
  switch (hwin->winclass)
  {
    case CLASS_WINDOW:
      /* Get left fill */
      cl=0xFF<<((x & 7) & 7);
      /* Get right fill */
      cr=0xFF>>((xm & 7) & 7);
      /* Fill left & right*/
      j=y;
      while (j<ym)
      {
        if (j==y+11)
        {
          FrameBuff[j][x >> 3] &= ~cl;
          FrameBuff[j][xm >> 3] &= ~cr;
        }
        else
        {
          FrameBuff[j][x >> 3] |= cl;
          FrameBuff[j][xm >> 3] |= cr;
        }
        j++;
      }
      j=y;
      while (j<ym)
      {
        i=(x >> 3)+1;
        while (i<(xm >> 3))
        {
          if (j==y+11)
          {
            FrameBuff[j][i] = 0x0;
          }
          else
          {
            FrameBuff[j][i] = 0xFF;
          }
          i++;
        }
        j++;
      }
      if (hwin->caption)
      {
        DrawWBString(x+3,y+1,hwin->caplen,hwin->caption);
      }
      FrameRect(x,y,xm-x,ym-y);
      break;
    case CLASS_BUTTON:
      if (FrameCount & 1)
      {
        /* Draw black to make the button appear graw */
        /* Get left fill */
        cl=0xFF<<((x & 7) & 7);
        /* Get right fill */
        cr=0xFF>>((xm & 7) & 7);
        /* Fill left & right*/
        j=y;
        while (j<ym)
        {
          FrameBuff[j][x >> 3] &= ~cl;
          FrameBuff[j][xm >> 3] &= ~cr;
          j++;
        }
        j=y;
        while (j<ym)
        {
          i=(x >> 3)+1;
          while (i<(xm >> 3))
          {
            FrameBuff[j][i] = 0;
            i++;
          }
          j++;
        }
      }
      else
      {
        if (hwin->caption)
        {
          x=x+(hwin->wt-hwin->caplen*TILE_WIDTH)/2;
          y=y+(hwin->ht-TILE_HEIGHT)/2;
          DrawWBString(x,y,hwin->caplen,hwin->caption);
        }
        if (hwin==Focus)
        {
          if (!(FrameCount & 3))
          {
            FrameRect(x,y,xm-x,ym-y);
          }
        }
        else
        {
          FrameRect(x,y,xm-x,ym-y);
        }
      }
      break;
    case CLASS_STATIC:
      if (hwin->caption)
      {
        x=x+(hwin->wt-hwin->caplen*TILE_WIDTH)/2;
        y=y+(hwin->ht-TILE_HEIGHT)/2;
        DrawWBString(x,y,hwin->caplen,hwin->caption);
      }
  }
  i=0;
  while (hwin->control[i] && i<MAX_CONTROLS)
  {
    DrawWindow(hwin->control[i]);
    i++;
  }
}

/**
  * @brief  This function handles default window events.
  * @param  hwin, event, param, ID
  * @retval None
  */
void DefWindowHandler(WINDOW* hwin,uint8_t event,uint16_t param,uint8_t ID)
{
  WINDOW* howner;

