01Hub/fbedit/STM32F4Discovery/STN32F4_GTVTerminal/video.c
  switch (event)
  {
    case EVENT_PAINT:
      DrawWindow(hwin);
      break;
    case EVENT_SHOW:
      if (param & STATE_VISIBLE)
      {
        hwin->state|=STATE_VISIBLE;
      }
      else
      {
        hwin->state&=~STATE_VISIBLE;
      }
      break;
    case EVENT_GOTFOCUS:
      hwin->state|=STATE_FOCUS;
      Focus=hwin;
      break;
    case EVENT_LOSTFOCUS:
      hwin->state&=~STATE_FOCUS;
      Focus=0;
      break;
    default:
      howner=hwin->owner;
      if (howner)
      {
        SendEvent(howner,event,param,ID);
      }
      break;
  }
}

/**
  * @brief  This function sends an event to a window
  * @param  hwin, event, param, ID
  * @retval None
  */
void SendEvent(WINDOW* hwin,uint8_t event,uint16_t param,uint8_t ID)
{
  hwin->handler(hwin,event,param,ID);
}

/**
  * @brief  This function handles TIM3 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  uint32_t i;

  /* Clear the IT pending Bit */
  TIM3->SR=(u16)~TIM_IT_Update;
  /* This loop eliminate differences in interrupt latency */
  i=32-((TIM3->CNT)>>1);
  if (i<LcMin)
  {
    LcMin=i;
  }
  if (i>LcMax)
  {
    LcMax=i;
  }
  while (i)
  {
    i--;
  }
  /* TIM4 is used to time the H-Sync (4,70uS) and the Back poch (5,70uS) */
  /* Set TIM4 auto reload */
  TIM4->ARR=(84*H_SYNC)/1000;                // 4,70uS
  /* Reset TIM4 count */
  TIM4->CNT=0;
  /* Enable TIM4 */
  TIM4->CR1=1;
  BackPochFlag = 0;
  /* H-Sync or V-Sync low */
  GPIOA->BSRRH = (uint16_t)GPIO_Pin_1;
  if (LineCount<SCREEN_HEIGHT)
  {
    /* Disable DMA1 Stream4 */
    DMA1_Stream4->CR &= ~((uint32_t)DMA_SxCR_EN);
    /* Reset interrupt pending bits for DMA1 Stream4 */
    DMA1->HIFCR = (uint32_t)(DMA_LISR_FEIF0 | DMA_LISR_DMEIF0 | DMA_LISR_TEIF0 | DMA_LISR_HTIF0 | DMA_LISR_TCIF0 | (uint32_t)0x20000000);
    DMA1_Stream4->NDTR = (uint16_t)SCREEN_BUFFWIDTH/2-1;
    DMA1_Stream4->PAR = (uint32_t) & (SPI2->DR);
    DMA1_Stream4->M0AR = (uint32_t) & (FrameBuff[LineCount]);
  }
}

/**
  * @brief  This function handles TIM4 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM4_IRQHandler(void)
{
  uint32_t i;

  /* Clear the IT pending Bit */
  TIM4->SR=(u16)~TIM_IT_Update;
  /* This loop eliminate differences in interrupt latency */
  i=32-((TIM4->CNT)>>1);
  while (i)
  {
    i--;
  }
  if (!BackPochFlag)
  {
    if (LineCount<SCREEN_HEIGHT+BOTTOM_MARGIN)
    {
      /* H-Sync high */
      GPIOA->BSRRL=(u16)GPIO_Pin_1;
    }
    else if (LineCount==SCREEN_HEIGHT+BOTTOM_MARGIN+V_SYNC)
    {
      /* V-Sync high */
      GPIOA->BSRRL=(u16)GPIO_Pin_1;
      LineCount=-(TOP_MARGIN+1);
    }
    /* Set TIM4 auto reload */
    TIM4->ARR=(84*BACK_POCH)/1000;                // 5,70uS
    BackPochFlag = 1;
  }
  else
  {
    /* Disable TIM4 */
    TIM4->CR1=0;
    if (LineCount>=0 && LineCount<SCREEN_HEIGHT)
    {
      /* Enable DMA1 Stream4 to keep the SPI port fed from the pixelbuffer. */
      DMA1_Stream4->CR |= (uint32_t)DMA_SxCR_EN;
    }
    else if (LineCount==SCREEN_HEIGHT)
    {
      /* If frame drawing busy, skip a frame */
      if (!FrameDraw)
      {
        /* Enable TIM5 */
        TIM5->CR1=1;
      }
    }
    LineCount++;
  }
}

/**
  * @brief  This function handles TIM5 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM5_IRQHandler(void)
{
  uint32_t *pd,*ps,i,pos,coll;

  /* Disable TIM5 */
  TIM5->CR1=0;
  /* Clear the IT pending Bit */
  TIM5->SR=(u16)~TIM_IT_Update;
  FrameDraw=1;
  /* Copy ScreenBuff to WorkBuff */
  pd=(uint32_t *)&FrameBuff;
  ps=(uint32_t *)&BackBuff;
  i=0;
  while (i<SCREEN_BUFFHEIGHT*SCREEN_BUFFWIDTH/4)
  {
    pd[i]=ps[i];
    i++;
  }
  /* Draw sprites onto WorkBuff */
  i=0;
  while (Sprites[i] && i<MAX_SPRITES)
  {
    coll=0;
    if (Sprites[i]->visible)
    {
      coll=DrawSprite(Sprites[i]);
      /* Boundary check */
      if (Sprites[i]->boundary)
      {
        pos=Sprites[i]->x;
        if ((int16_t)pos<=Sprites[i]->boundary->left)
        {
          coll|=COLL_LEFT;
        }
        pos+=Sprites[i]->icon.wt;
        if ((int16_t)pos>=Sprites[i]->boundary->right)
        {
          coll|=COLL_RIGHT;
        }
        pos=Sprites[i]->y;
        if ((int16_t)pos<=Sprites[i]->boundary->top)
        {
          coll|=COLL_TOP;
        }
        pos+=Sprites[i]->icon.ht;
        if ((int16_t)pos>=Sprites[i]->boundary->bottom)
        {
          coll|=COLL_BOTTOM;
        }
      }
    }
    Sprites[i]->collision=coll;
    i++;
  }
  /* Draw windows onto WorkBuff */
  i=0;
  while (Windows[i] && i<MAX_WINDOWS)
  {
    if (Windows[i]->state & STATE_VISIBLE)
    {
      Windows[i]->handler(Windows[i],EVENT_PAINT,0,0);
    }
    i++;
  }
  /* Draw cursor */
  if (Cursor.visible)
  {
    DrawSprite(&Cursor);
  }
  DrawHex(0,0,LineCount,1);
  FrameCount++;
  FrameDraw=0;
}

